Repository: pinkyhi/BirthdayBot
Catalog: BirthdayBot.Core/Resources/SharedResources.*.resx
Languages: ru, uk

# WELCOME_TEXT
source: Hi, {0}, that's great to see you here again!
ru: Привет, {0}, здорово снова видеть тебя тут!
uk: Привіт, {0}, гарно знову бачити тебе тут!

# BIRTH_YEAR_INPUT
source: Please submit your year of birth.
ru: Пожалуйста, отправь свой год рождения.
uk: Будь ласка, відправ свій рік народження.

# BIRTH_MONTH_INPUT
source: Ok! Next, send your birth month :)
ru: Окей! Теперь мне нужен месяц твоего рождения)
uk: Окей! Тепер мені потрібен місяць твого народження)

# BIRTH_DAY_INPUT
source: Successfully! Next, I need a birth day
ru: Успешно! Дальше мне нужен день рождения
uk: Успішно! Далі мені потрібен день народження

# START_LOCATION_INPUT
source: Last step. Send your geolocation or the name of your city. This is necessary in order to know your time zone. You have {0} attempts left
ru: Последний шаг. Отправь свою геопозицию или название своего города. Это нужно для того чтобы знать твой часовой пояс. У тебя осталось {0} попыток
uk: Останній крок. Відправ свою геопозіцію, або геопозіцію свого міста. Це потрібно для того щоб знати твій часовий пояс. У вас залишилося {0} спроб

# PEOPLE_BUTTON
source: People🥳
ru: Люди🥳
uk: Люди🥳

# USER_SETTINGS_BUTTON
source: Settings
ru: Настройки
uk: Налаштування

# BIRTH_YEAR_INPUT_ERROR
source: It looks like there is an error in the year format. Try to enter the year of birth again, for example <b>2001</b>
ru: Похоже что есть ошибка в формате года. Попробуй ввести год рождения ещё раз, например <b>2001</b>
uk: Схоже що є помилка в форматі року. Спробуй ввести рік народження ще раз, наприклад <b>2001</b>

# BIRTH_MONTH_INPUT_ERROR
source: I can't recognize the month, use the keyboard below.
ru: Не получается распознать месяц, используй клавиатуру ниже.
uk: Не виходить розпізнати місяць, використовуй клавіатуру нижче.

# BIRTH_DAY_INPUT_ERROR
source: It doesn't look like a birthday, try writing the day of the month, for example <b>22</b>
ru: Это не похоже на день рождения, попробуй написать число месяца, например <b>22</b>
uk: Це не схоже на день народження, спробуй написати число місяця, наприклад <b>22</b>

source: January
ru: Январь
uk: Січень

source: March
ru: Март
uk: Березень

source: April
ru: Апрель
uk: Квітень

source: May
ru: Май
uk: Травень

source: June
ru: Июнь
uk: Червень

source: July
ru: Июль
uk: Липень

source: August
ru: Август
uk: Серпень

source: September
ru: Сентябрь
uk: Вересень

source: October
ru: Октябрь
uk: Жовтень

source: November
ru: Ноябрь
uk: Листопад

source: December
ru: Декабрь
uk: Грудень

source: February
ru: Февраль
uk: Лютий

# SHARE_LOCATION_BUTTON
source: Share location📍
ru: Поделиться локацией📍
uk: Поділитися локацією📍

# GEOPOSITION_INPUT_ERROR
source: The geotag could not be recognized. Try again, attempts left - {0}
ru: Не удалось распознать геометку. Попробуй ещё раз, осталось попыток – {0}
uk: Не вдалося розпізнати геометку. Спробуй ще раз, залишилося спроб – {0}

# GEOPOSITION_CONFIRMATION
source: Is that right position?
ru: Это правильная геопозиция?
uk: Це правильна геопозіція?

# CONFIRM_BUTTON
source: Confirm
ru: Подтвердить
uk: Підтвердити

# REJECT_BUTTON
source: Reject
ru: Отменить
uk: Скасувати

# BIRTH_DATE_CONFIRMATION
source: Ok, your birthday is {0}. Right?
ru: Ок, твой день рождения {0}. Верно?
uk: Ок, твій день нарождення {0}. Так?

# INPUT_BLOCK
source: You can't input this value up to {0}
ru: Ты не можешь вводить это значение до {0}
uk: Ти не має змоги вводити це значення до {0}

# NOTIFICATIONS_SETTINGS_BUTTON
source: Notifications
ru: Уведомления
uk: Повідомлення

# LANGUAGE_SETTINGS_BUTTON
source: Language
ru: Язык
uk: Мова

# CONFIDENTIALITY_SETTINGS_BUTTON
source: Confidentiality
ru: Конфиденциальность
uk: Конфіденційність

# PROFILE_SETTINGS_BUTTON
source: Profile settings
ru: Настройки профиля
uk: Налаштування профілю

# STRONG_NOTIFICATIONS_BUTTON
source: Improved subscription
ru: Улучшенная подписка
uk: Покращена підписка

# COMMON_NOTIFICATIONS_BUTTON
source: Simple subscription
ru: Простая подписка
uk: Проста підписка

# NOTIFICATIONS_SETTINGS_INFO
source: You can change the parameter, how many days before the event you will receive notifications. You can change it for both types of subscriptions.
ru: Ты можешь, изменить параметр, за сколько дней до события тебе будут приходить уведомления. Ты можешь изменить его для обоих типов подписки.
uk: Ти можеш змінити параметр, за скільки днів до події тобі будуть приходити повідомлення. Ти можеш змінити його для обох типів підписки.

# NOTIFICATIONS_SETTINGS_TEXT
source: Here you can change your notification settings
ru: Здесь ты можешь изменить настройки уведомлений
uk: Тут ти можеш змінити налаштування сповіщень

# NOTIFICATIONS_SETTINGS_CHANGE_TEXT
source: The buttons below represent the notification delay. Click on one of them to change it. <i>Example: 0 - On this day; 3 - In 3 days</i>
ru: Кнопки ниже представляют задержку уведомления. Нажми на одну из них, чтобы изменить его. <i>Пример: 0 - В этот день; 3 - За 3 дня</i>
uk: Кнопки нижче представляють затримку повідомлення. Натисни на одну з них, щоб змінити його. <i>Приклад: 0 - В цей день; 3 - За 3 дня</i>

# LANGUAGE_SETTINGS_TEXT
source: Here you can change the interface language
ru: Здесь ты можешь поменять язык интерфейса
uk: У цьому меню ти маєш змогу змінити мову інтерфейсу

# CONFIDENTIALITY_SETTINGS_INFO
source: Age * Private - hide the year of birth * Mutual - open if mutually signed * Public - visible to everyone
ru: Возраст *Частный - скрыть год рождения *Взаимный - открыть если подписаны взаимно *Публичный - виден всем
uk: Вік * Приватний - приховати рік народження * Взаємний - відкрити якщо підписані взаємно * Публічний - видно всім

# CONFIDENTIALITY_SETTINGS_TEXT
source: Here you can change privacy. Age privacy: <code>{0}</code>
ru: Здесь ты можешь изменить конфиденциальность. Конфиденциальность возраста: <code>{0}</code>
uk: Тут ти можеш змінити конфіденційність Вікова конфіденційність <code>{0}</code>

# PUBLIC_CONFIDENTIALITY_TYPE
source: Public
ru: Публичное
uk: Публічне

# PRIVATE_CONFIDENTIALITY_TYPE
source: Private
ru: Приватный
uk: Приватний

# MUTUAL_CONFIDENTIALITY_TYPE
source: Mutual
ru: Взаимный
uk: Взаємний

# AGE_CONFIDENTIALITY_BUTTON
source: Age confidentiality
ru: Конфиденциальность возраста
uk: Вікова конфіденційність

# PROFILE_SETTINGS_TEXT
source: Here you can change your profile. Your date of birth: <code>{0}</code> Your location: <code>{1}</code> Your time zone <b>{2}</b>
ru: Здесь ты можешь изменить свой профиль. Твоя дата рождения: <code> {0} </code> Твоя местоположение: <code> {1} </code> Твой часовой пояс <b> {2} </b>
uk: Тут ти можеш змінити свій профіль. Твоя дата народження <code> {0} </code> Твоя місцезнаходження <code> {1} </code> Твій часовий пояс <b> {2} </b>

# CHANGE_BIRTH_DATE_BUTTON
source: Change birthdate
ru: Изменить дату рождения
uk: Змінити дату народження

# CHANGE_LOCATION_BUTTON
source: Change location
ru: Изменить локацию
uk: Змінити локацію

# USER_SETTINGS_TEXT
source: Main settings
ru: Основные настройки
uk: Основні налаштування

# NOTIFICATIONS_SETTINGS_CHANGE_BUTTON
source: {0} days before
ru: За {0} дней
uk: За {0} днів

# NOTIFICATIONS_SETTINGS_CHANGE_INPUT
source: Send the desired notification delay in days. Please enter a number between 0 and 28
ru: Отправь желаемую задержку уведомления в днях. Введите число от 0 до 28
uk: Надішли бажану затримку в днях. Введіть число від 0 до 28

# NOTIFICATIONS_SETTINGS_CHANGE_INPUT_ERROR
source: I can't make it out :( Try using an integer, like <code>7</code> It must be between 0 and 28.
ru: Не могу разобрать :( Попробуй использовать целое число, например <code>7</code> Оно должно быть от 0 до 28.
uk: Не можу зрозуміти :( Спробуй ціле число, наприклад<code> 7 </code>, від 0 до 28.

# BACK_BUTTON
source: Back
ru: Назад
uk: Назад

# CONFIDENTIALITY_TYPE_INPUT
source: Enter the privacy type or select it from the keyboard below.
ru: Введи тип конфиденциальности или выберите его с клавиатуры ниже.
uk: Введи тип конфіденційності або виберіть його з клавіатури нижче.

# INPUT_ERROR
source: I didn't understand the input format🤖, please try again.
ru: Я не понял формат ввода🤖, попробуй еще раз.
uk: Я не зрозумів формат введення🤖, спробуй ще раз.

# YOU_CHOOSED_TEXT
source: You choosed <b>{0}</b>
ru: Было выбрано <b>{0}</b>
uk: Було обрано <b>{0}</b>

# NOTES_BUTTON
source: Events✍️
ru: События✍️
uk: Події✍️

# HELP_PRIVATE_TEXT
source: <b> What can I do? 🎉 </b> 1. You can add your friend (who is in the bot) to the list of reminders, and you will receive notifications about his birthday. <i> To do this, visit the <b> People </b> </i> page. 2. If the person is not in the bot, you can add an event with the appropriate name and date to your reminder calendar. 3. There are two types of reminders: * Regular subscription - 1 notification * Improved subscription - 3 notifications You can configure the time for sending notifications on the page <i> Settings → <b> Notifications </b> </i> 4. In addition to setting the subscription types, you can also change privacy, language, or profile settings such as location or date of birth. <b> Security 🛡 </b> @yourdate_bot cannot read your chat, except for Telegram commands and notifications, for example, "New chat member" etc. We do not share your personal information with third parties. The bot needs your location to understand your local time. You can hide your age in the settings, in this case, only the month and day will be available to other users of the bot.
ru: <b>Что я умею? 🎉</b> 1. Ты можешь добавить своего друга (который есть в боте) в список напоминаний, и ты будешь получать уведомления о его дне рождения. <i>Для этого зайди страницу <b>Люди</b></i>. 2. Если человека нет в боте, ты можешь добавить в свой календарь напоминаний событие с соответствующим названием и датой. 3. Есть два типа напоминаний: * Обычная подписка - 1 уведомление * Улучшенная подписка - 3 уведомления Ты можешь настроить время отправки уведомлений на странице <i>Настройки→<b>Уведомления</b></i> 4. Кроме настроек типов подписки, ты также можешь изменить конфиденциальность, язык или настройки профиля, такие как местоположение или дата рождения. <b> Безопасность 🛡 </b> @yourdate_bot не может читать ваш чат, кроме команд и уведомлений Telegram, например «Новый участник чата» и т.д. Мы не передаем вашу личную информацию сторонним компаниям. Боту нужно ваше местоположение, чтобы понимать ваше местное время. Вы можете скрыть свой возраст в настройках, в этом случае другим пользователям бота будут доступны только месяц и день.
uk: <b>Що я вмію? 🎉</b> 1. Ти можеш додати свого друга (який є в боті) в список нагадувань, і ти будеш отримувати повідомлення про його дні народження. <i>Для цього зайди сторінку <b>Люди</b></ i>. 2. Якщо людини не має в боті, ти можеш додати в свій календар нагадувань подію з відповідною назвою і датою. 3. Є два типи нагадувань: * Звичайна підписка - 1 повідомлення * Покращена підписка - 3 повідомлення Ти можеш налаштувати час відправки повідомлень на сторінці <i>Налаштування → <b>Повідомлення</b></ i> 4. Крім налаштувань типів підписки, ти також можеш змінити конфіденційність, мову або настройки профілю, такі як місце розташування або дата народження. <b>Безпека 🛡</b> @yourdate_bot не може читати ваш чат, крім команд і повідомлень Telegram, наприклад «Новий учасник чату» і т.д. Ми не передаємо вашу особисту інформацію стороннім компаніям. Боту потрібно ваше місце розташування, щоб розуміти ваш місцевий час. Ви можете приховати свій вік в настройках, в цьому випадку іншим користувачам бота будуть доступні тільки місяць і день.

# CALENDAR_MENU_TEXT
source: Birthdays in {0}:
ru: Дни рождения в {0}:
uk: Дні народження в {0}:

# MENU_OPENER_TEXT
source: Wait...
ru: Подождите...
uk: Почекайте...

source: Share to group
ru: Добавить в чат
uk: Додати до чату

# REPLY_KEYBOARD_REMOVE_TEXT
source: Temporary data cleared.
ru: Временные данные удалены.
uk: Тимчасові дані очищено.

# CHANGE_LOCATION_INPUT
source: Submit your location using the button below or submit your city name. You have {0} tries.
ru: Отправь свое местоположение с помощью кнопки ниже или отправь название своего города. У тебя есть {0} попыток.
uk: Відправ своє місце розташування за допомогою кнопки нижче або відправ назву свого міста. У тебе є {0} спроб.

# NOTES_TEXT
source: <b>Events</b> Here you can view the added events or create new ones.
ru: <b>События</b> Здесь ты можешь просмотреть добавленные события или создать новые.
uk: <b>Події</b> Тут ти можеш переглянути додані події або створити нові.

# NOTE_TITLE_INPUT
source: Submit the name of the event.
ru: Отправь имя события.
uk: Відправ ім'я події.

# NOTE_YEAR_INPUT
source: Ok, now I'm waiting for the event year
ru: Хорошо, теперь я жду год события
uk: Добре, тепер я чекаю рік події

# NOTE_MONTH_INPUT
source: Next, I'm waiting the month.
ru: Дальше жду месяц.
uk: Далі я чекаю місяць.

# NOTE_DAY_INPUT
source: And finally – day.
ru: И последнее – день.
uk: Та останнє – день.

# NOTE_DATE_CONFIRMATION
source: Is that right date? <b>{0}</b>
ru: Это правильная дата? <b>{0}</b>
uk: Це правильна дата? <b>{0}</b>

# COMMON_NOTIFICATION_TEXT
source: Simple subscription (1 notification).
ru: Простая подписка (1 уведомление).
uk: Проста підписка (1 повідомлення).

# NOTE_TEXT
source: <b>Event</b> Title: {0} Date: {1} {2}
ru: <b>Событие</b> Заголовок: {0} Дата: {1} {2}
uk: <b>Подія</b> Заголовок: {0} Дата: {1} {2}

# REMOVE_BUTTON
source: Remove🗑
ru: Удалить 🗑
uk: Видалити🗑

# STRONG_NOTIFICATION_TEXT
source: Improved subscription (3 notifications).
ru: Улучшенная подписка (3 уведомления).
uk: Покращена підписка (3 повідомлення).

# NOTE_REMOVE_CONFIRMATION
source: Are you sure you want to delete this event?
ru: Ты уверен, что хочешь удалить это событие?
uk: Ти впевнений, що хочеш видалити цю подію?

# PEOPLE_TEXT
source: <b>People</b> Here you can view your subscriptions on people or add a new one.
ru: <b>Люди</b> Здесь ты можешь посмотреть подписки на людей или добавить новую.
uk: <b>Люди</b> Тут ти можете подивитися підписки на людей або додати нову.

# SUBSCRIPTION_TEXT
source: <b>Subscription</b> User name: {0} Date: {1} {2}
ru: <b>Подписка</b> Имя пользователя: {0} Дата: {1} {2}
uk: <b>Підписка</b> Ім'я користувача: {0} Дата: {1} {2}

# SUBSCRIPTION_REMOVE_CONFIRMATION
source: Are you sure, that you want to remove this subscription?
ru: Уверен, что хочешь удалить эту подписку?
uk: Впевнений, що хочеш видалити цю підписку?

# ADD_PEOPLE_TEXT
source: Choose an adding way
ru: Выберите способ добавления
uk: Оберіть спосіб додавання

# CHATS_BUTTON
source: By chat
ru: Через чат
uk: У чаті

# CHATS_TEXT
source: If you select a chat, you can add people from that chat's calendar to your reminder list.
ru: Выбрав чат, ты сможешь добавить в свой список напоминаний людей из календаря этого чата.
uk: Вибравши чат, ти зможеш додати в свій список нагадувань людей з календаря цього чату.

# PERSONAL_BUTTON
source: By username
ru: По нику
uk: За ніком

# ADD_PERSONAL_INPUT
source: Enter username <i>For example</i>: <code>@yourdate_bot</code>
ru: Введите никнейм пользователя <i>Например</i>: <code>@yourdate_bot</code>
uk: Введіть нікнейм користувача.

# ADD_PERSONAL_INPUT_NOT_FOUND
source: {0} ❓ I don't know this user😔 You can send him an invitation or create an event manually.
ru: {0}❓ Я не знаю такого пользователя😔 Ты можешь отправить ему приглашение или создать событие вручную.
uk: {0}❓ Я не знаю цього користувача😔 Ты маєш змогу запросити його або створити подію вручну.

# ADD_MANUALLY_BUTTON
source: Add event
ru: Добавить событие
uk: Додати подію

# PERSONAL_INVITE_TEXT
source: Hello, your friend invites you to this bot. It reminds of friends' birthdays and it is quite convenient🎁. I'm waiting for you there :) Use this referral link and I'll get a notification that you are already connected. {0}
ru: Привет, твой друг приглашает тебя в этого бота. Он напоминает о днях рождения друзей и это достаточно удобно🎁. Жду тебя там :) Используй эту ссылку и я получу уведомление что ты присоединился. {0}
uk: Привіт, твій друг запрошує тебе в цього бота. Він нагадує про дні народження друзів і це досить удобно🎁. Чекаю тебе там :) Використовуй це посилання та я отримаю повідомлення, що ти приєднався {0}

# SEND_PERSONAL_INVITE_BUTTON
source: Send invite
ru: Отправить приглашение
uk: Надіслати запрошення

# ADD_PERSONAL_INPUT_SUCCESS
source: I found! 🎉 Now you have it in your reminder list :)
ru: Я нашел! 🎉 Теперь он есть у тебя в списке напоминаний:)
uk: Я знайшов! 🎉 Зараз він є у твоєму списку нагадувань:)

# SUBSCRIPTION_PREVIEW_TEXT
source: <b>Subscription preview</b> Title: {0} Date: {1}
ru: <b>Предварительный просмотр подписки</b> Заголовок: {0} Дата: {1}
uk: <b>Попередній перегляд підписки</b> Заголовок: {0} Дата: {1}

# SUBSCRIBE_BUTTON
source: Subscribe👌
ru: Подписаться👌
uk: Підписатися👌

# SUBSCRIBE_ON_MEMBER_SUCCESS
source: Subscription created successfully🎉
ru: Подписка успешно создана🎉
uk: Підписка успішно створена🎉

# JOIN_CHAT_CALENDAR_BUTTON
source: Join chat calendar📆
ru: Присоединиться к календарю чата📆
uk: Приєднатися до календаря чату📆

# ADDED_TO_CHAT_TEXT
source: Hi, I am @yourdate_bot and I am here to remind you of friends' birthdays🎁. You can add your friend to the chat calendar📆 or tell me in PM. I will help you make a list of notifications (you can find friends by nickname, or via chat), and shortly before an important date, I will mention you so that you don’t forget anything. By the way, if you add to the chat calendar, I will definitely throw a reminder about your birthday in this chat🎉. If this is not enough for you, you can create your own events (and not only about birthdays).
ru: Привет, я @yourdate_bot, и я здесь, чтобы напоминать тебе о днях рождения друзей🎁. Ты можешь добавить свой др в календарь чата📆 или сказать мне в лс. Я помогу тебе составить список уведомлений (друзей ты сможешь найти по нику, или через чат) и незадолго до важной даты я пну тебя, что бы ты ничего не забыл. Кстати, если ты добавишься в календарь чата, я обязательно кину напоминалку о твоем дне рождения в этот чат🎉. Если этого тебе не достаточно, ты можешь создавать свои события (и не только о днях рождения).
uk: Привіт, я @yourdate_bot, і я тут, щоб нагадувати тобі про дні народження друзів🎁. Ти можеш додати свій день народження в календар чата📆 або сказати мені в лс. Я допоможу тобі скласти список повідомлень (друзів ти зможеш знайти за ніком, або через чат) і незадовго до важливої дати я штовхну тебе, що б ти нічого не забув. До речі, якщо ти додаш себе в календар чату, я обов'язково нагадаю й про твій день народження у цей чат🎉. Якщо цього тобі не достатньо, ти можеш створювати свої події (і не тільки дні народження).

# SUCCESS_START_FROM_CHAT
source: You have been successfully added to the chat calendar <b> {0} </b> 🎉. If you want to exit the chat calendar, you can re-join the chat)
ru: Ты успешно добавлен в календарь чата <b>{0}</b> 🎉. Если хочешь выйти из календаря чата, можешь перезайти в чат)
uk: Ти успішно доданий в календар чату <b>{0}</b> 🎉. Якщо хочеш вийти з календаря чату, можеш перезайти в чат)

# CHAT_WARNING_TEXT
source: ⚠️I don't see anyone on the calendar of this chat. Run the command <code>/calendar</code> in the chat so others can join! ⚠️
ru: ⚠️Я никого не вижу в календаре этого чата. Вызови команду <code>/calendar</code> в чате, чтобы другие могли присоединиться!⚠️
uk: ⚠️Я нікого не бачу в календарі цього чату. Виклич команду <code>/calendar</code> у чаті, щоб інші могли приєднатися!⚠️

# CHAT_CALENDAR_MENU_TEXT
source: <b>Chat calendar</b> Users in calendar <i>{0}/{1}</i>
ru: <b>Календарь чата</b> Пользователей в календаре <i>{0}/{1}</i>
uk: <b>Календар чату</b> Користувачі в календарі <i>{0}/{1}</i>

# ADDED_USER_TO_CHAT_TEXT
source: As I see, we have a new member :) Hello {0}! To join the general calendar, click on the button. This one ⬇️.
ru: Как я вижу, у нас появился новый участник :) Привет, {0}! Что бы присоединиться к общему календарю нажми на кнопку. Вот эту ⬇️.
uk: Як я бачу, у нас з'явився новий учасник :) Привіт, {0}! Що б приєднатися до загального календаря натисни на кнопку. Ось цю ⬇️.

# ADD_PERSONAL_INPUT_MULTIPLE
source: The user is not found. Perhaps you meant <b>{0}</b>
ru: Пользователь не найден. Возможно, ты имел в виду <b>{0}</b>
uk: Користувач не знайден. Можливо, ти маєш на увазі <b>{0}</b>

# ADD_PERSONAL_INPUT_ERROR
source: Format error, please try again.
ru: Ошибка формата, попробуйте снова.
uk: Помилковий формат, спробуйте ще раз.

# ADDED_TO_CHAT_ERROR
source: I don't know why, but I'm a little broke. Remove me and try again a little later :(
ru: Не знаю почему, но я немного сломался. Удали меня и попробуй еще раз немного позже :(
uk: Не знаю чому, але я трошки зломався. Видали мене та спробуй ще раз пізніше :(

# HELP_CHAT_TEXT
source: Use this command in personal chat with me :)
ru: Используй эту команду у меня в лс :)
uk: Використовуй цю команду у мене в лс :)

# ALL_USERS_ADDED_TEXT
source: Wow! 🥳 Everyone successfully connected to the calendar! The dev is happy and praises me❤️.
ru: Вау!🥳 Все успешно подключились к календарю! Разраб доволен и хвалит меня❤️.
uk: Чудово!🥳 Усі учасники підключені до календаря чату! Разраб задоволений й хвалит мене❤️.

# PERSONAL_NOTE_NOTIFICATION_TEXT
source: <b>❗️Notification❗️</b> Event <i>{0}</i> Will hit on {1}
ru: <i>❗️Напоминание❗️</i> Событие <b>{0}</b> Произойдёт {1}
uk: <i>Повідомлення</i> Примітка <b>{0}</b> Відбудеться {1}

# PERSONAL_SUB_NOTIFICATION_TEXT
source: <b>❗️Notice❗️</b> <code> {0} </code> has birthday on - {1} :) Don't forget🎉
ru: <b>❗️Уведомление❗️</b> <code>{0}</code> празднует день рождения - {1} :) Не забудь 🎉
uk: <b>Повідомлення</b> <code>{0}</code> вказав дату народження - {1} :) <i>Часовий пояс: {2}</i>

# CHAT_BIRTH_NOTIFICATION_TEXT
source: @{0} happy birthday! 🎁🎂🎁 You are a cool chip :) <i> Date: {1}; Time zone: {2} </i>
ru: @{0}, с днем рождения!🎁🎂🎁 Ты крутой чипс :) <i> Дата: {1}; Часовой пояс: {2} </i>
uk: @{0}, з днем народження! 🎁🎂🎁 Ти крутий чіпс :) <i>Дата: {1}; Часовий пояс: {2}</i>

# 29_FEBRUARY_WARNING_TEXT
source: ⚠️In a low-rise year, this date will be represented as March 1st.⚠️
ru: ⚠️В невысокосный год эта дата будет представлена как 1 марта.⚠️
uk: ⚠️В невисокосний рік ця дата буде представлена як 1 березня.⚠️

# FIRST_CHAT_MEMBERS_COUNT_NOTIFICATION
source: There are so few participants in the calendar😔, please add more. <i>Number of participants: {0}/{1}</i>
ru: В календаре так мало участников😔, скорее добавляйтесь. <i>Количество участников: {0}/{1}</i>
uk: У календарі так мало участніков😔, швидше за додавайтеся. <i>Кількість учасників: {0}/{1}</i>

# SECOND_CHAT_MEMBERS_COUNT_NOTIFICATION
source: There are still less than a third of people on the calendar. I'm a little worried😟. <i>Number of participants: {0}/{1}</i>
ru: Людей в календаре все еще меньше трети. Я капельку волнуюсь😟. <i>Количество участников: {0}/{1}</i>
uk: Людей у календарі все ще менше третини. Я крапельку хвилююсь😟. <i>Кількість учасників: {0}/{1}</i>

# THIRD_CHAT_MEMBERS_COUNT_NOTIFICATION
source: And still, less than a third of the participants joined the calendar. Okay, I won't remind you again. I hope you really remember each other's birthdays ❤️ <i>Number of participants: {0}/{1}</i>
ru: И все так-же менее трети участников присоединилось к календарю. Ладно, больше не буду напоминать. Надеюсь вы и правда помните о днях рождения друг друга ❤️ <i>Количество участников: {0}/{1}</i>
uk: І все так-же менше третини учасників приєдналося до календаря. Гаразд, більше не буду нагадувати. Сподіваюся Ви таки справді пам'ятайте про дні народження один одного ❤️ <i>Кількість учасників: {0}/{1}</ i>

# ACTUALIZE_USER_BUTTON
source: Update user
ru: Обновить профиль
uk: Оновити користувача
