Repository: pinkyhi/BirthdayBot
Catalog: BirthdayBot.Core/Resources/SharedResources.*.resx
Languages: ru, uk

# ACTUALIZE_USER_TEXT
source: Your username is updated :)
ru: Твой ник обновился :)
uk: Твоє ім'я оновлено

# SUBSCRIPTIONS_LIMIT
source: Subscriptions limit reached
ru: Достигнут лимит по количеству подписок
uk: Досягнуто ліміт за кількістю підписок

# USER_PLACEHOLDER
source: chip
ru: чипс
uk: чіпс

# ADDED_USER_TO_CHAT_ERROR
source: Hi, I see someone new has joined us :) To join the general calendar, click on the button. This one ⬇️.
ru: Привет, вижу к нам присоединился кто-то новый :) Что бы присоединиться к общему календарю нажми на кнопку. Вот эту ⬇️.
uk: Привіт, бачу до нас приєднався хтось новий :) Що б приєднатися до загального календаря натисни на кнопку. Ось цю ⬇️.

# NOTES_LIMIT
source: Event limit reached
ru: Достигнут лимит количества событий
uk: Досягнуто ліміт кількості подій

# TRANSFERED_NOTE_CREATION
source: Creation event {0}:
ru: Создание события {0}:
uk: Створення події {0}:

# CHATS_WARNING_TEXT
source: I don't see any chat calendar with you. Call the command <code>/calendar</code> in the desired chat and join :)
ru: Я не вижу ни одного календаря чата с тобой. Вызови команду <code>/calendar</code> в нужном чате и присоединись)
uk: Я не бачу жодного календаря чату з тобою. Виклич команду <code>/calendar</code> в потрібному чаті і приєднайся).

# SUBSCRIBE_ON_MEMBER_DUPLICATE
source: You already have a subscription to this person
ru: У тебя уже есть подписка на этого человека
uk: У тебе вже є підписка на цю людину

# OPEN_CHAT_ERROR
source: Can't open chat :( Please try later
ru: Не могу открыть чат :( Попробуй позже
uk: Не можу відкрити чат :( Спробуй пізніше

# CALENDAR_BUTTON
source: Reminder list
ru: Список напоминаний
uk: Список повідомлень

# PROFILE_SETTINGS_INFO
source: * Date of birth - changes the date also for people who are already following you. * Location - 3 attempts to change location. * Update - update the name/username in the bot.
ru: *Дату рождения - меняет дату также для людей которые уже подписаны на вас. *Локацию - 3 попытки для изменения локации. *Актуализация - обновить имя/ник в боте.
uk: * Дату народження - змінює дату також для людей які вже підписані на вас. * Локації - 3 спроби для зміни локації. * Актуалізація - оновити ім'я/нік в боті.

# CHAT_START_TEXT
source: Use this command in personal chat with me :)
ru: Используй эту команду у меня в лс :)
uk: Використовуй цю команду у персональному чаті зі мною :)

# JANUARY_SHORT
source: Jan.
ru: Янв.
uk: Січ.

# FEBRUARY_SHORT
source: Feb.
ru: Фев.
uk: Лют.

# MARCH_SHORT
source: Mar.
ru: Мар.
uk: Бер.

# APRIL_SHORT
source: Apr.
ru: Апр.
uk: Квіт.

# MAY_SHORT
source: May.
ru: Май.
uk: Трав.

# JUNE_SHORT
source: Jun.
ru: Июнь
uk: Чер.

# JULY_SHORT
source: Jul.
ru: Июль
uk: Лип.

# AUGUST_SHORT
source: Aug.
ru: Авг.
uk: Сер.

# SEPTEMBER_SHORT
source: Sep.
ru: Сен.
uk: Вер.

# OCTOBER_SHORT
source: Oct.
ru: Окт.
uk: Жов.

# NOVEMBER_SHORT
source: Nov.
ru: Нояб.
uk: Лист.

# DECEMBER_SHORT
source: Dec.
ru: Дек.
uk: Груд.

# NOT_TELEGRAM_USER_TEXT
source: To adding not telegram user's birthday event use <b>Events</b>. Now you are redirected to event creation.
ru: Чтобы добавить событие дня рождения пользователя которого нет в Telegram, используй <b>События</b>. Теперь ты перенаправлен к созданию события.
uk: Для того щоб додати подію дня народження людини якої немає у Telegram, використовуй <b>Події</b>. Зараз тебе переадресовано на створення події.

# NOT_TELEGRAM_USER_BUTTON
source: Without telegram
ru: Без Telegram
uk: Без Telegram

# REFERRAL_NOTIFICATION
source: {0} connected to the bot by your referral link
ru: {0} присоединился по твоей реферальной ссылке
uk: {0} приєднався за твоїм реферальним посиланням

# NO_CONTACT_ERROR
source: I don't see contact. Try to attach contact, you can do it only from mobile Telegram version.
ru: Я не вижу контакт. Попробуй прикрепить контакт, ты можешь сделать это только через мобильную версию Telegram.
uk: Я не бачу контакт. Спробуй додати контакт, ти можеш зробити це тільки через мобільний додаток Telegram.

# EMPTY_CONTACT_ERROR
source: Seems to be that this person doesn't use Telegram.
ru: Похоже этот человек не использует Telegram.
uk: Схоже ця людина не користується Telegram.

# CONTACT_NOT_FOUND
source: I don't know this user :(
ru: Я не знаю этого пользователя :(
uk: Я не знаю цього користувача :(

# ADD_BY_CONTACT_BUTTON
source: By contact
ru: По контакту
uk: По контакту

# ADD_BY_CONTACT_INPUT
source: Send contact
ru: Отправь контакт
uk: Відправ контакт

# ADD_PERSONAL_INPUT_DUPLICATE
source: You are already subscribed to this person
ru: Ты уже подписался на этого пользователя раньше.

# REFERRAL_TARGET_UNKNOWN
source: Seems this person already doesn't use this bot.
ru: Похоже этот человек не использует бота.

# SUBSCRIBE_REFERRAL_ERROR
source: I can't create a subscription automatically. Try to make it on your own.
ru: У меня не получается создать подписку автоматически. Попытайся сделать это сам.

# GEOPOSITION_DENIED_ERROR
source: Seems that I have problems now :( Try again later.
ru: Похоже у меня сейчас проблемы :( Попробуй позже.

# FRIEND_ADDED_TO_CHAT_CALENDAR
source: {0} added himself to {1} chat calendar. Would you like to subscribe to him?
ru: {0} добавился в календарь чата {1}. Подписаться на этого пользователя?

# UNSUBSCRIBE_CHAT_BUTTON
source: Don't show anymore🔕
ru: Не уведомлять🔕

# SUBSCRIBE_ALL_BUTTON
source: Subscribe all🧨
ru: Подписаться на всех🧨

# SUBSCRIBE_ALL_TEXT
source: Subscriptions to all from this chat are created!
ru: Созданы подписки на всех из этого чата!

# UNSUBSCRIBE_ALL_BUTTON
source: Unsubscribe all👋
ru: Отписаться от всех👋

# UNSUBSCRIBE_ALL_TEXT
source: You have unsubscribed from all chat members
ru: Ты отписался от всех участников чата

# REFERRAL_BACK_NOTIFICATION
source: You have been invited by {0}. Would you like to subscribe?
ru: Тебя пригласил {0}. Подписаться на него?

# CHAT_SUBSCRIPTION_CHANGED_TO_ON
source: Now you are subscribed on the chat calendar.
ru: Теперь ты подписан на календарь чата.

# CHAT_SUBSCRIPTION_CHANGE_TO_ON_BUTTON
source: Track chat calendar🔔
ru: Следить за календарем чата🔔

# CHAT_SUBSCRIPTION_CHANGE_TO_OFF_BUTTON
source: Stop track chat calendar🔕
ru: Не следить за календарем🔕

# INVITE_FRIEND_BUTTON
source: Invite friend
ru: Пригласить друга

# OPEN_CHAT_TEXT
source: In this menu, you can subscribe to chat members.
ru: В этом меню ты можешь подписаться на учасников чата.

# MAIN_CHATS_BUTTON
source: Chats💬
ru: Чаты💬

# ADD_PEOPLE_FROM_CHAT_TEXT
source: To add people from chat you can use <b>Chats💬</b> menu. You are redirected to this menu.
ru: Чтобы добавлять людей через чат, используй меню <b>Чаты💬</b>. Ты был перенаправлен в это меню.
